org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** Golang                                                                      :golang:
:PROPERTIES:
:EXPORT_FILE_NAME: golang
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :toc true
:END:

*** Microservices

- [[https://blog.gopheracademy.com/advent-2019/building-a-microservices-network][Building a global services network using Go, QUIC and Micro]]
- [[https://sudonull.com/post/8187-Microservices-on-Go-with-the-Go-kit-Introduction][Microservices on Go with the Go Kit]]
- [[https://ewanvalentine.io/how-im-writing-serverless-services-in-golang-these-days/][How I'm writing Serverless services in Golang]]
  #+begin_quote
  Service discovery allows you to register the location of services, with a user
  friendly name, so that you can find other services by name. AWS provides a
  Serverless offering for this, called [[https://aws.amazon.com/cloud-map/][Cloudmap]]
  #+end_quote
  [[https://github.com/peak-ai/ais-service-discovery-go][cloud application library]]

  #+begin_quote
  The most important lesson I hope you take away from this, however, is protecting your business logic from the sea of AWS services and technologies. Treat Lambda as an unimportant detail, treat DynamoDB as an unimportant detail
  #+end_quote
- [[https://blog.gopheracademy.com/advent-2019/building-a-microservices-network/][Building a global services network using Go, QUIC and Micro]]
- [[https://ieftimov.com/post/make-resilient-golang-net-http-servers-using-timeouts-deadlines-context-cancellation/][Make resilient Go net/http servers using timeouts, deadlines and context cancellation]]
  Initialize ~net/http~ server with timeouts:

  #+begin_src
    srv := &http.Server{
        ReadTimeout:       1 * time.Second,
        WriteTimeout:      1 * time.Second,
        IdleTimeout:       30 * time.Second,
        ReadHeaderTimeout: 2 * time.Second,
        TLSConfig:         tlsConfig,
        Handler:           srvMux,
    }
  #+end_src

  - the ~net/http~ packages provide a ~TimeoutHandler~
  - it returns a handler that runs a handler within the given time limit
  - use ~Context~ to be aware of request
- [[https://dev.to/ilyakaznacheev/a-clean-way-to-pass-configs-in-a-go-application-1g64][A clean way to pass configs in a Go application]]

*** AppSec

- [[https://www.sohamkamani.com/blog/golang/2019-01-01-jwt-authentication/][Implementing JWT based authentication in Golang]]

**** Beyondcorp

- [[https://github.com/ory][ory.sh]]
  #+begin_quote
  ORY is the open source and cloud native identity infrastructure. ORY is written
  in Go and open standards and consensus are the foundation. It is language and
  platform independent, extremely lightweight, starts up in seconds and doesn’t
  interfere with your code

  Inspired by Google's BeyondCorp
  #+end_quote

***** TODO [[https://www.ory.sh/docs/next/ecosystem/projects][ory ecosystem]] :read:
*** AWS

- [[https://github.com/awslabs/aws-apigateway-lambda-authorizer-blueprints/blob/master/blueprints/go/main.go][API Gateway Authorizer Blueprint in Golang]]
- [[https://cloudnative.ly/lambdas-with-golang-a-technical-guide-6f381284897b][API Gateway Custom Authorizer]]
- [[https://dev.to/wingkwong/a-simple-amazon-api-gateway-lambda-authoriser-in-go-4cgd][A simple AWS API Gateway Authoriser in Go]]
- [[https://github.com/guregu/dynamo][expressive DynamoDB library for Go]]
**** CDK
- [[https://aws.amazon.com/blogs/developer/getting-started-with-the-aws-cloud-development-kit-and-go/][Getting started with CDK and Golang]]
- [[https://blog.john-pfeiffer.com/using-aws-cdk-to-configure-deploy-a-golang-lambda-with-apigateway/][Using AWS CDK to configure deploy a Golang Lambda with API Gateway]]

*** Books

- [[https://github.com/dariubs/GoBooks][List of interesting Golang Books]]

*** Configuration
**** Spacemacs

Pre-requisites to use the [[https://develop.spacemacs.org/layers/+lang/go/README.html][go-layer]] inside ~spacemacs~:
#+begin_src
GO111MODULE=on go get -v golang.org/x/tools/gopls@latest
GO111MODULE=on CGO_ENABLED=0 go get -v -trimpath -ldflags '-s -w' github.com/golangci/golangci-lint/cmd/golangci-lint
go get -u -v golang.org/x/tools/cmd/godoc
go get -u -v golang.org/x/tools/cmd/goimports
go get -u -v golang.org/x/tools/cmd/gorename
go get -u -v golang.org/x/tools/cmd/guru
go get -u -v github.com/cweill/gotests/...
go get -u -v github.com/davidrjenni/reftools/cmd/fillstruct
go get -u -v github.com/fatih/gomodifytags
go get -u -v github.com/godoctor/godoctor
go get -u -v github.com/haya14busa/gopkgs/cmd/gopkgs
go get -u -v github.com/josharian/impl
go get -u -v github.com/mdempsky/gocode
go get -u -v github.com/rogpeppe/godef
go get -u -v github.com/zmb3/gogetdoc
#+end_src
**** doom emacs
- [[https://qiita.com/Ladicle/items/feb5f9dce9adf89652cf][Ladicle Golang Doom Emacs customizations]]
**** GTAGS
~gtags~ will create ~CTAGS~ files to [[https://www.gnu.org/software/global/][global]]. For Go you can use [[https://github.com/juntaki/gogtags][gogtags]] to
generate the files. It also works well with [[https://melpa.org/#/helm-gtags][helm-gtags]].

*** Code Examples

- [[http://l3x.github.io/golang-code-examples/][l3x.github.io/golang-code-examples/]]
*** Code Style
- [[https://yolken.net/blog/cleaner-go-code-golines][Cleaner go code with golines]]
- [[https://golang.org/doc/effective_go][Effective Go (golang.org)]]
- [[https://rytisbiel.com/2021/03/06/darker-corners-of-go/][Darker Corners of Go]]
  - covers most of the 101 topics beginners should know about Golang
**** Clean Code Examples
- [[https://github.com/ahmetb/kubectx][github.com/ahmetb/kubectx]]
- [[https://github.com/gojek/heimdall][github.com/gojek/heimdall]]
- [[https://github.com/ethereum/go-ethereum][github.com/ethereum/go-ethereum]]
- [[https://github.com/drone/drone][github.com/drone/drone]]
- [[https://github.com/google/exposure-notifications-server][github.com/google/exposure-notifications-server]]
*** Design

- [[https://dave.cheney.net/2016/08/20/solid-go-design][SOLID Go Design]]
- [[https://the-zen-of-go.netlify.com/][The Zen of Go]]
  - [[https://dave.cheney.net/2020/02/23/the-zen-of-go][more detailed version]]
- [[https://github.com/RefactoringGuru/design-patterns-go][Design Patterns by refactoring.guru]]
- [[https://medium.com/@matiasvarela/hexagonal-architecture-in-go-cfd4e436faa3][Hexagonal Architecture in Go]]
*** Fun
- [[https://github.com/SuperPaintman/the-evolution-of-a-go-programmer][Evolution of a Go programmer]]
*** Internals
- [[https://www.alexedwards.net/blog/a-recap-of-request-handling][A recap of request handling in Go]]
- [[https://lanre.wtf/blog/2017/07/24/roundtripper-go/][Diving deep into net/http : A look at http.RoundTripper]]
- [[https://echorand.me/posts/golang-dissecting-listen-and-serve/][Dissecting golang's HandlerFunc, Handle and DefaultServeMux]]
- [[https://jaxenter.de/golumne-go-requests-multiplexen-81161][Requests richtig verarbeiten: Keine Sorge beim Multiplexen in Go]]
- [[https://rafallorenz.com/go/handle-signals-to-graceful-shutdown-http-server/][How to handle signals with Go to graceful shutdown HTTP server]]
- [[https://eli.thegreenplace.net/2021/life-of-an-http-request-in-a-go-server/][Life of an HTTP request in a Go server - Eli Bendersky's website]]
