content/bookmarks/golang.md
+++
title = "Golang"
author = ["Victor Dorneanu"]
lastmod = 2021-05-11T10:28:54+02:00
tags = ["bookmark", "golang"]
draft = false
weight = 2001
toc = true
+++

## Microservices {#microservices}

-   [Building a global services network using Go, QUIC and Micro](https://blog.gopheracademy.com/advent-2019/building-a-microservices-network)
-   [Microservices on Go with the Go Kit](https://sudonull.com/post/8187-Microservices-on-Go-with-the-Go-kit-Introduction)
-   [How I'm writing Serverless services in Golang](https://ewanvalentine.io/how-im-writing-serverless-services-in-golang-these-days/)

    > Service discovery allows you to register the location of services, with a user
    > friendly name, so that you can find other services by name. AWS provides a
    > Serverless offering for this, called [Cloudmap](https://aws.amazon.com/cloud-map/)

    [cloud application library](https://github.com/peak-ai/ais-service-discovery-go)

    > The most important lesson I hope you take away from this, however, is protecting your business logic from the sea of AWS services and technologies. Treat Lambda as an unimportant detail, treat DynamoDB as an unimportant detail
-   [Building a global services network using Go, QUIC and Micro](https://blog.gopheracademy.com/advent-2019/building-a-microservices-network/)
-   [Make resilient Go net/http servers using timeouts, deadlines and context cancellation](https://ieftimov.com/post/make-resilient-golang-net-http-servers-using-timeouts-deadlines-context-cancellation/)
    Initialize `net/http` server with timeouts:

    ```nil
          srv := &http.Server{
              ReadTimeout:       1 * time.Second,
              WriteTimeout:      1 * time.Second,
              IdleTimeout:       30 * time.Second,
              ReadHeaderTimeout: 2 * time.Second,
              TLSConfig:         tlsConfig,
              Handler:           srvMux,
          }
    ```

    -   the `net/http` packages provide a `TimeoutHandler`
    -   it returns a handler that runs a handler within the given time limit
    -   use `Context` to be aware of request
-   [A clean way to pass configs in a Go application](https://dev.to/ilyakaznacheev/a-clean-way-to-pass-configs-in-a-go-application-1g64)


## AppSec {#appsec}

-   [Implementing JWT based authentication in Golang](https://www.sohamkamani.com/blog/golang/2019-01-01-jwt-authentication/)


### Beyondcorp {#beyondcorp}

-   [ory.sh](https://github.com/ory)

    > ORY is the open source and cloud native identity infrastructure. ORY is written
    > in Go and open standards and consensus are the foundation. It is language and
    > platform independent, extremely lightweight, starts up in seconds and doesn’t
    > interfere with your code
    >
    > Inspired by Google's BeyondCorp


#### <span class="org-todo todo TODO">TODO</span> [ory ecosystem](https://www.ory.sh/docs/next/ecosystem/projects) {#ory-ecosystem}


## AWS {#aws}

-   [API Gateway Authorizer Blueprint in Golang](https://github.com/awslabs/aws-apigateway-lambda-authorizer-blueprints/blob/master/blueprints/go/main.go)
-   [API Gateway Custom Authorizer](https://cloudnative.ly/lambdas-with-golang-a-technical-guide-6f381284897b)
-   [A simple AWS API Gateway Authoriser in Go](https://dev.to/wingkwong/a-simple-amazon-api-gateway-lambda-authoriser-in-go-4cgd)
-   [expressive DynamoDB library for Go](https://github.com/guregu/dynamo)


### CDK {#cdk}

-   [Getting started with CDK and Golang](https://aws.amazon.com/blogs/developer/getting-started-with-the-aws-cloud-development-kit-and-go/)
-   [Using AWS CDK to configure deploy a Golang Lambda with API Gateway](https://blog.john-pfeiffer.com/using-aws-cdk-to-configure-deploy-a-golang-lambda-with-apigateway/)


## Books {#books}

-   [List of interesting Golang Books](https://github.com/dariubs/GoBooks)


## Configuration {#configuration}


### Spacemacs {#spacemacs}

Pre-requisites to use the [go-layer](https://develop.spacemacs.org/layers/+lang/go/README.html) inside `spacemacs`:

```nil
GO111MODULE=on go get -v golang.org/x/tools/gopls@latest
GO111MODULE=on CGO_ENABLED=0 go get -v -trimpath -ldflags '-s -w' github.com/golangci/golangci-lint/cmd/golangci-lint
go get -u -v golang.org/x/tools/cmd/godoc
go get -u -v golang.org/x/tools/cmd/goimports
go get -u -v golang.org/x/tools/cmd/gorename
go get -u -v golang.org/x/tools/cmd/guru
go get -u -v github.com/cweill/gotests/...
go get -u -v github.com/davidrjenni/reftools/cmd/fillstruct
go get -u -v github.com/fatih/gomodifytags
go get -u -v github.com/godoctor/godoctor
go get -u -v github.com/haya14busa/gopkgs/cmd/gopkgs
go get -u -v github.com/josharian/impl
go get -u -v github.com/mdempsky/gocode
go get -u -v github.com/rogpeppe/godef
go get -u -v github.com/zmb3/gogetdoc
```


### doom emacs {#doom-emacs}

-   [Ladicle Golang Doom Emacs customizations](https://qiita.com/Ladicle/items/feb5f9dce9adf89652cf)


### GTAGS {#gtags}

`gtags` will create `CTAGS` files to [global](https://www.gnu.org/software/global/). For Go you can use [gogtags](https://github.com/juntaki/gogtags) to
generate the files. It also works well with [helm-gtags](https://melpa.org/#/helm-gtags).


## Code Examples {#code-examples}

-   [l3x.github.io/golang-code-examples/](http://l3x.github.io/golang-code-examples/)


## Code Style {#code-style}

-   [Cleaner go code with golines](https://yolken.net/blog/cleaner-go-code-golines)
-   [Effective Go (golang.org)](https://golang.org/doc/effective%5Fgo)
-   [Darker Corners of Go](https://rytisbiel.com/2021/03/06/darker-corners-of-go/)
    -   covers most of the 101 topics beginners should know about Golang


### Clean Code Examples {#clean-code-examples}

-   [github.com/ahmetb/kubectx](https://github.com/ahmetb/kubectx)
-   [github.com/gojek/heimdall](https://github.com/gojek/heimdall)
-   [github.com/ethereum/go-ethereum](https://github.com/ethereum/go-ethereum)
-   [github.com/drone/drone](https://github.com/drone/drone)
-   [github.com/google/exposure-notifications-server](https://github.com/google/exposure-notifications-server)


## Design {#design}

-   [SOLID Go Design](https://dave.cheney.net/2016/08/20/solid-go-design)
-   [The Zen of Go](https://the-zen-of-go.netlify.com/)
    -   [more detailed version](https://dave.cheney.net/2020/02/23/the-zen-of-go)
-   [Design Patterns by refactoring.guru](https://github.com/RefactoringGuru/design-patterns-go)
-   [Hexagonal Architecture in Go](https://medium.com/@matiasvarela/hexagonal-architecture-in-go-cfd4e436faa3)


## Fun {#fun}

-   [Evolution of a Go programmer](https://github.com/SuperPaintman/the-evolution-of-a-go-programmer)


## Internals {#internals}

-   [A recap of request handling in Go](https://www.alexedwards.net/blog/a-recap-of-request-handling)
-   [Diving deep into net/http : A look at http.RoundTripper](https://lanre.wtf/blog/2017/07/24/roundtripper-go/)
-   [Dissecting golang's HandlerFunc, Handle and DefaultServeMux](https://echorand.me/posts/golang-dissecting-listen-and-serve/)
-   [Requests richtig verarbeiten: Keine Sorge beim Multiplexen in Go](https://jaxenter.de/golumne-go-requests-multiplexen-81161)
-   [How to handle signals with Go to graceful shutdown HTTP server](https://rafallorenz.com/go/handle-signals-to-graceful-shutdown-http-server/)
-   [Life of an HTTP request in a Go server - Eli Bendersky's website](https://eli.thegreenplace.net/2021/life-of-an-http-request-in-a-go-server/)
