org/blog.org
**** Context
- [[https://blog.golang.org/context-and-structs][Contexts and structs]]
    #+begin_quote
    Context provides a means of transmitting deadlines, caller cancellations, and other request-scoped values across API boundaries and between processes. It is often used when a library interacts --- directly or transitively --- with remote servers, such as databases, APIs

    When designing an API with context, remember the advice: pass =context.Context= in as an argument; don't store it in structs.
    #+end_quote

- [[https://steveazz.xyz/blog/import-context/][How to use context in different uses cases]]

*** Interviews

- [[https://evrone.com/rob-pike-interview    ][2020-05 | Rob Pike interview for Evrone: “Go has become the language of cloud infrastructure”]]

*** Messaging
**** Bots
***** Slack

- [[https://github.com/slack-go/slack/tree/master/examples][slack-go/slack examples]]
- [[https://blog.gopheracademy.com/advent-2017/go-slackbot/][Create a Slack bot using Golang]]
- [[https://medium.com/mercari-engineering/writing-an-interactive-message-bot-for-slack-in-golang-6337d04f36b9][Write an interactive message bot for Slack in Golang]]
  - full code: [[https://github.com/tcnksm/go-slack-interactive][go-slack-interactive]]
- [[https://api.slack.com/docs/token-types#bot][bot tokens]]
- [[http://davestevens.github.io/slack-message-builder/][slack-message-builder]]
- [[https://api.slack.com/messaging/composing/layouts#attachments][message attachments]]
- [[https://api.slack.com/tools/block-kit-builder][block kit builder]]
- *Frameworks*
  - [[https://github.com/shomali11/slacker][github.com/shomali11/slacker]]
- [[https://github.com/go-chat-bot/bot][github.com/go-chat-bot/bot]]
  - IRC, SLACK, Telegram and RocketChat bot written in Go
- [[https://github.com/alexandre-normand/slackscot][github.com/alexandre-normand/slackscot]]
  - Slack bot core/framework written in Go with support for reactions to message updates/deletes
*** Malware
- [[https://blog.netlab.360.com/blackrota-an-obfuscated-backdoor-written-in-go-en/amp/][Blackrota, a heavily obfuscated backdoor written in Go]]
*** Modules

- [[https://bencane.com/stories/2020/07/06/how-i-structure-go-packages/][How I Structure Go Packages]]
  Some great advice about logging and package structure
- [[https://peter.bourgon.org/go-best-practices-2016/#repository-structure][Go best practices, 6 years in]]

*** Testing

- [[https://github.com/quii/learn-go-with-tests][Learn go with test-driven development (TDD)]]
- [[https://deliveroo.engineering/2019/05/17/testing-go-services-using-interfaces.html][Testing Go services using interfaces (deliveroo)]]
- [[https://medium.com/@kelvin_sp/building-and-testing-a-rest-api-in-golang-using-gorilla-mux-and-mysql-1f0518818ff6][Building and Testing a REST API in GoLang using Gorilla Mux and MySQL]]
- [[https://blog.codecentric.de/en/2017/08/gomock-tutorial/][Testing with GoMock: A Tutorial - codecentric AG Blog]]
- [[https://blog.codecentric.de/2019/07/gomock-vs-testify/][GoMock vs. Testify: Mocking frameworks for Go]]
  - learn how to use ~mockery~ and ~testify~
  - 3 classes fo failures:
    - Unexpected calls
    - Missing calls (expected, but not occurred)
    - Expected calls with unexpected parameter values
- [[https://blog.alexellis.io/golang-writing-unit-tests/][Golang basics - writing unit tests]]
- [[https://lanre.wtf/blog/2017/04/08/testing-http-handlers-go/][Testing HTTP Handlers in Go]]
- [[https://mkaz.blog/code/testing-clients-to-an-http-api-in-go/][Testing Clients to an HTTP API in Go]]
- [[https://blog.gopheracademy.com/advent-2016/how-to-write-good-tests-for-solid-code/][Writing good unit tests for SOLID go]]
  - structs will depend on interfaces instead of structs (easy for dependency injection)
  - What should be tested:
    - when testing, you can think of it as sending and receiving messages
    - *incoming messages* refer to calls to methods
    - *outgoing messages* refers to calls from the tested object on its dependencies
  - most people go first to integration tests
- [[https://getstream.io/blog/how-we-test-go-at-stream/][Testing Go at Stream]]
- [[https://medium.com/swlh/using-go-interfaces-for-testable-code-d2e11b02dea][Using Go Interfaces for Testable Code - The Startup - Medium]]
  - using interfaces for stubbing
- [[https://dev.to/ilyakaznacheev/how-i-write-my-unit-tests-in-go-quickly-4bd5][2020-05 | How I write my unit tests in Go quickly]]
  - on dependency injection
  - duck typing interfaces
  - BDD (Behaviour Driven Development)

**** Fuzzing

- [[https://medium.com/a-journey-with-go/go-fuzz-testing-in-go-deb36abc971f][Go: Fuzz Testing in Go - A Journey With Go]]

**** TDD

- More on [[*TDD]]
Great resources:
- [[HTTPS://github.com/quii/learn-go-with-tests][github.com/quii/learn-go-with-tests]]
- [[https://leanpub.com/golang-tdd/read][leanpub.com/golang-tdd/read]]
  - really good explanations

*** Tools

- [[https://www.alexedwards.net/blog/an-overview-of-go-tooling][An overview of Go's tooling]]
- [[https://arenzana.org/2019/01/emacs-go-mode/][Emacs and Go mode]]
- [[https://github.com/ChimeraCoder/gojson][gojson]]: Automatically generate Go (golang) struct definitions from example JSON
- [[https://godoc.org/golang.org/x/tools][golang.org/x/tools]]
  - [[http://golang.org/s/using-guru][go-guru]]
- [[https://github.com/davecgh/go-spew][go-spew]]: Implements a deep pretty printer for Go data structures to aid in debugging
- [[https://zoralab.gitlab.io/godocgen/en-us/][godocgen]]
  #+begin_quote
  Godocgen is an app built using Go programming language to generate Go module
  package's documentations. It parses the packages documentation data and
  facilitates custom rendering, enabling Gopher to use other hosting solution
  like Hugo to host the documents.
  #+end_quote
- [[https://github.com/aaronjanse/3mux][3mux]]: Terminal multiplexer inspired by i3
- [[https://github.com/jumbleview/tspur][tspur]]: Terminal Screen with Protected User Records (TSPUR)
- [[https://mholt.github.io/json-to-go/][json-to-go]]
  - This tool instantly converts JSON into a Go type definition

*** Templates

- [[https://blog.gopheracademy.com/advent-2017/using-go-templates/][Using go templates]]

*** Logging

- [[https://www.0value.com/about-go-logging][About Go logging for reusable packages]]

  Use some global variadic function:

  #+begin_src go
    package mypkg

    // LogFunc is a function that logs the provided message with optional
    // fmt.Sprintf-style arguments. By default, logs to the default log.Logger.
    var LogFunc func(string, ...interface{}) = log.Printf
  #+end_src

- [[https://www.reddit.com/r/golang/comments/em8uiu/how_to_start_with_logging_in_go_projects_part_2/][Some words about logging]]
  - Some tips:
    - Never log in a package that isn't main
    - Don't log things if the program is operating normally
    - only log in package main

- [[https://dave.cheney.net/2015/11/05/lets-talk-about-logging][Let's talk about logging]]
- [[https://github.com/go-kit/kit/tree/master/log][go-kit/log]]

*** OO

- [[https://icyapril.com/go/programming/2017/12/17/object-orientation-in-go.html][Object Oriented Go - The Basics]]
*** Packaging
- [[https://www.zombiezen.com/blog/2020/09/how-i-packaged-go-program-windows-linux/][Zombie Zen - How I packaged a Go program for Windows and Linux]]
- [[https://www.gobeyond.dev/packages-as-layers/amp/][Packages as layers, not groups]]
  - How to think of your modules as layers and not as groups
  - by Ben Johnson (wo wrote the [[https://medium.com/@benbjohnson/standard-package-layout-7cdbc8391fc1][standard package layout]])
- [[https://bencane.com/2020/12/29/how-to-structure-a-golang-cli-project/][How to Structure a Go Command-Line Project]]
- [[https://peter.bourgon.org/go-best-practices-2016/#repository-structure][Go best practices, six years in]]
