content/bookmarks/golang.md


### Context {#context}

-   [Contexts and structs](https://blog.golang.org/context-and-structs)

    > Context provides a means of transmitting deadlines, caller cancellations, and other request-scoped values across API boundaries and between processes. It is often used when a library interacts --- directly or transitively --- with remote servers, such as databases, APIs
    >
    > When designing an API with context, remember the advice: pass `context.Context` in as an argument; don't store it in structs.

-   [How to use context in different uses cases](https://steveazz.xyz/blog/import-context/)


## Interviews {#interviews}

-   [2020-05 | Rob Pike interview for Evrone: “Go has become the language of cloud infrastructure”](https://evrone.com/rob-pike-interview%20%20%20%20)


## Messaging {#messaging}


### Bots {#bots}


#### Slack {#slack}

-   [slack-go/slack examples](https://github.com/slack-go/slack/tree/master/examples)
-   [Create a Slack bot using Golang](https://blog.gopheracademy.com/advent-2017/go-slackbot/)
-   [Write an interactive message bot for Slack in Golang](https://medium.com/mercari-engineering/writing-an-interactive-message-bot-for-slack-in-golang-6337d04f36b9)
    -   full code: [go-slack-interactive](https://github.com/tcnksm/go-slack-interactive)
-   [bot tokens](https://api.slack.com/docs/token-types#bot)
-   [slack-message-builder](http://davestevens.github.io/slack-message-builder/)
-   [message attachments](https://api.slack.com/messaging/composing/layouts#attachments)
-   [block kit builder](https://api.slack.com/tools/block-kit-builder)
-   **Frameworks**
    -   [github.com/shomali11/slacker](https://github.com/shomali11/slacker)
-   [github.com/go-chat-bot/bot](https://github.com/go-chat-bot/bot)
    -   IRC, SLACK, Telegram and RocketChat bot written in Go
-   [github.com/alexandre-normand/slackscot](https://github.com/alexandre-normand/slackscot)
    -   Slack bot core/framework written in Go with support for reactions to message updates/deletes


## Malware {#malware}

-   [Blackrota, a heavily obfuscated backdoor written in Go](https://blog.netlab.360.com/blackrota-an-obfuscated-backdoor-written-in-go-en/amp/)


## Modules {#modules}

-   [How I Structure Go Packages](https://bencane.com/stories/2020/07/06/how-i-structure-go-packages/)
    Some great advice about logging and package structure
-   [Go best practices, 6 years in](https://peter.bourgon.org/go-best-practices-2016/#repository-structure)


## Testing {#testing}

-   [Learn go with test-driven development (TDD)](https://github.com/quii/learn-go-with-tests)
-   [Testing Go services using interfaces (deliveroo)](https://deliveroo.engineering/2019/05/17/testing-go-services-using-interfaces.html)
-   [Building and Testing a REST API in GoLang using Gorilla Mux and MySQL](https://medium.com/@kelvin%5Fsp/building-and-testing-a-rest-api-in-golang-using-gorilla-mux-and-mysql-1f0518818ff6)
-   [Testing with GoMock: A Tutorial - codecentric AG Blog](https://blog.codecentric.de/en/2017/08/gomock-tutorial/)
-   [GoMock vs. Testify: Mocking frameworks for Go](https://blog.codecentric.de/2019/07/gomock-vs-testify/)
    -   learn how to use `mockery` and `testify`
    -   3 classes fo failures:
        -   Unexpected calls
        -   Missing calls (expected, but not occurred)
        -   Expected calls with unexpected parameter values
-   [Golang basics - writing unit tests](https://blog.alexellis.io/golang-writing-unit-tests/)
-   [Testing HTTP Handlers in Go](https://lanre.wtf/blog/2017/04/08/testing-http-handlers-go/)
-   [Testing Clients to an HTTP API in Go](https://mkaz.blog/code/testing-clients-to-an-http-api-in-go/)
-   [Writing good unit tests for SOLID go](https://blog.gopheracademy.com/advent-2016/how-to-write-good-tests-for-solid-code/)
    -   structs will depend on interfaces instead of structs (easy for dependency injection)
    -   What should be tested:
        -   when testing, you can think of it as sending and receiving messages
        -   **incoming messages** refer to calls to methods
        -   **outgoing messages** refers to calls from the tested object on its dependencies
    -   most people go first to integration tests
-   [Testing Go at Stream](https://getstream.io/blog/how-we-test-go-at-stream/)
-   [Using Go Interfaces for Testable Code - The Startup - Medium](https://medium.com/swlh/using-go-interfaces-for-testable-code-d2e11b02dea)
    -   using interfaces for stubbing
-   [2020-05 | How I write my unit tests in Go quickly](https://dev.to/ilyakaznacheev/how-i-write-my-unit-tests-in-go-quickly-4bd5)
    -   on dependency injection
    -   duck typing interfaces
    -   BDD (Behaviour Driven Development)


### Fuzzing {#fuzzing}

-   [Go: Fuzz Testing in Go - A Journey With Go](https://medium.com/a-journey-with-go/go-fuzz-testing-in-go-deb36abc971f)


### TDD {#tdd}

-   More on [TDD](#tdd)

Great resources:

-   [github.com/quii/learn-go-with-tests](//github.com/quii/learn-go-with-tests)
-   [leanpub.com/golang-tdd/read](https://leanpub.com/golang-tdd/read)
    -   really good explanations


## Tools {#tools}

-   [An overview of Go's tooling](https://www.alexedwards.net/blog/an-overview-of-go-tooling)
-   [Emacs and Go mode](https://arenzana.org/2019/01/emacs-go-mode/)
-   [gojson](https://github.com/ChimeraCoder/gojson): Automatically generate Go (golang) struct definitions from example JSON
-   [golang.org/x/tools](https://godoc.org/golang.org/x/tools)
    -   [go-guru](http://golang.org/s/using-guru)
-   [go-spew](https://github.com/davecgh/go-spew): Implements a deep pretty printer for Go data structures to aid in debugging
-   [godocgen](https://zoralab.gitlab.io/godocgen/en-us/)

    > Godocgen is an app built using Go programming language to generate Go module
    > package's documentations. It parses the packages documentation data and
    > facilitates custom rendering, enabling Gopher to use other hosting solution
    > like Hugo to host the documents.
-   [3mux](https://github.com/aaronjanse/3mux): Terminal multiplexer inspired by i3
-   [tspur](https://github.com/jumbleview/tspur): Terminal Screen with Protected User Records (TSPUR)
-   [json-to-go](https://mholt.github.io/json-to-go/)
    -   This tool instantly converts JSON into a Go type definition


## Templates {#templates}

-   [Using go templates](https://blog.gopheracademy.com/advent-2017/using-go-templates/)


## Logging {#logging}

-   [About Go logging for reusable packages](https://www.0value.com/about-go-logging)

    Use some global variadic function:

    ```go
          package mypkg

          // LogFunc is a function that logs the provided message with optional
          // fmt.Sprintf-style arguments. By default, logs to the default log.Logger.
          var LogFunc func(string, ...interface{}) = log.Printf
    ```

-   [Some words about logging](https://www.reddit.com/r/golang/comments/em8uiu/how%5Fto%5Fstart%5Fwith%5Flogging%5Fin%5Fgo%5Fprojects%5Fpart%5F2/)
    -   Some tips:
        -   Never log in a package that isn't main
        -   Don't log things if the program is operating normally
        -   only log in package main

-   [Let's talk about logging](https://dave.cheney.net/2015/11/05/lets-talk-about-logging)
-   [go-kit/log](https://github.com/go-kit/kit/tree/master/log)


## OO {#oo}

-   [Object Oriented Go - The Basics](https://icyapril.com/go/programming/2017/12/17/object-orientation-in-go.html)


## Packaging {#packaging}

-   [Zombie Zen - How I packaged a Go program for Windows and Linux](https://www.zombiezen.com/blog/2020/09/how-i-packaged-go-program-windows-linux/)
-   [Packages as layers, not groups](https://www.gobeyond.dev/packages-as-layers/amp/)
    -   How to think of your modules as layers and not as groups
    -   by Ben Johnson (wo wrote the [standard package layout](https://medium.com/@benbjohnson/standard-package-layout-7cdbc8391fc1))
-   [How to Structure a Go Command-Line Project](https://bencane.com/2020/12/29/how-to-structure-a-golang-cli-project/)
-   [Go best practices, six years in](https://peter.bourgon.org/go-best-practices-2016/#repository-structure)
