org/blog.org
*** Serialization

- [[http://choly.ca/post/go-json-marshalling/][Custom JSON Marshalling in Go]]
  - Nice elegant solution using aliases, e.g.

  #+begin_src go
    func (u *MyUser) MarshalJSON() ([]byte, error) {
      type Alias MyUser
      return json.Marshal(&struct {
        LastSeen int64 `json:"lastSeen"`
        ,*Alias
      }{
        LastSeen: u.LastSeen.Unix(),
        Alias:    (*Alias)(u),
      })
    }
  #+end_src
- [[http://gregtrowbridge.com/golang-json-serialization-with-interfaces/][Golang JSON Serialization With Interfaces]]
  - Working with plants and animals
  - adds extra field ~type~ to know which struct to use
- [[https://stackoverflow.com/questions/42721732/is-there-a-way-to-have-json-unmarshal-select-struct-type-based-on-type-prope][Is there a way to have json.Unmarshal() select struct type based on “type” property?]]
  - how to do deserialization when field is a list of interfaces
  - implement ~UnmarshalJSON~ on slice of interfaces
  - [[https://play.golang.org/p/zQyL0JeB3b][Example with []vehicle]]

*** Security

- [[https://blog.trailofbits.com/2019/11/07/attacking-go-vr-ttps/][Security assessment techniques for go projects]]
  - static analysis, fuzzing, dynamic testing etc.
- [[https://goteleport.com/blog/csrf-attacks/][CSRF Attacks]]
  - Implementing CSRF, auth handler
**** Pentest
- [[https://github.com/sysdream/hershell][github.com/sysdream/hershell]]
- [[https://github.com/sysdream/chashell][github.com/sysdream/chashell]]
  - using DNS as reverse shell
- [[https://github.com/sysdream/ligolo][github.com/sysdream/ligolo]]
**** Botnets
- [[https://github.com/gnxbr/Unbreakable-Botnet-C2][github.com/gnxbr/Unbreakable-Botnet-C2]]
  - using Blockchains for communication channel
**** Scanners
- [[https://github.com/v-byte-cpu/sx][github.com/v-byte-cpu/sx]]
*** Surveys
- [[https://blog.jetbrains.com/go/2021/02/03/the-state-of-go/][State of Go in 2021]]
*** UI
- [[https://www.vugu.org/][Vugu]]
  - A modern UI library for Go+WebAssembly
