content/bookmarks/golang.md


## Serialization {#serialization}

-   [Custom JSON Marshalling in Go](http://choly.ca/post/go-json-marshalling/)

    -   Nice elegant solution using aliases, e.g.

    <!--listend-->

    ```go
          func (u *MyUser) MarshalJSON() ([]byte, error) {
            type Alias MyUser
            return json.Marshal(&struct {
              LastSeen int64 `json:"lastSeen"`
              *Alias
            }{
              LastSeen: u.LastSeen.Unix(),
              Alias:    (*Alias)(u),
            })
          }
    ```
-   [Golang JSON Serialization With Interfaces](http://gregtrowbridge.com/golang-json-serialization-with-interfaces/)
    -   Working with plants and animals
    -   adds extra field `type` to know which struct to use
-   [Is there a way to have json.Unmarshal() select struct type based on “type” property?](https://stackoverflow.com/questions/42721732/is-there-a-way-to-have-json-unmarshal-select-struct-type-based-on-type-prope)
    -   how to do deserialization when field is a list of interfaces
    -   implement `UnmarshalJSON` on slice of interfaces
    -   [Example with []vehicle](https://play.golang.org/p/zQyL0JeB3b)


## Security {#security}

-   [Security assessment techniques for go projects](https://blog.trailofbits.com/2019/11/07/attacking-go-vr-ttps/)
    -   static analysis, fuzzing, dynamic testing etc.
-   [CSRF Attacks](https://goteleport.com/blog/csrf-attacks/)
    -   Implementing CSRF, auth handler


### Pentest {#pentest}

-   [github.com/sysdream/hershell](https://github.com/sysdream/hershell)
-   [github.com/sysdream/chashell](https://github.com/sysdream/chashell)
    -   using DNS as reverse shell
-   [github.com/sysdream/ligolo](https://github.com/sysdream/ligolo)


### Botnets {#botnets}

-   [github.com/gnxbr/Unbreakable-Botnet-C2](https://github.com/gnxbr/Unbreakable-Botnet-C2)
    -   using Blockchains for communication channel


### Scanners {#scanners}

-   [github.com/v-byte-cpu/sx](https://github.com/v-byte-cpu/sx)


## Surveys {#surveys}

-   [State of Go in 2021](https://blog.jetbrains.com/go/2021/02/03/the-state-of-go/)


## UI {#ui}

-   [Vugu](https://www.vugu.org/)
    -   A modern UI library for Go+WebAssembly
